Ran Plan for project: `platform` dir: `2.platform` workspace: `default`

<details><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # helm_release.vault has changed
~ resource "helm_release" "vault" {
        id                         = "vault"
      ~ metadata                   = [
          ~ {
              ~ last_deployed  = 1765346709 -> 1765347492
                name           = "vault"
              ~ revision       = 7 -> 8
                # (7 unchanged attributes hidden)
            },
        ]
        name                       = "vault"
        # (27 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # helm_release.vault will be updated in-place
~ resource "helm_release" "vault" {
      ~ cleanup_on_fail            = false -> true
      ~ force_update               = false -> true
        id                         = "vault"
      ~ metadata                   = [
          - {
              - app_version    = "1.20.4"
              - chart          = "vault"
              - first_deployed = 1765295513
              - last_deployed  = 1765347492
              - name           = "vault"
              - namespace      = "platform"
              - notes          = <<-EOT
                    Thank you for installing HashiCorp Vault!
                    
                    Now that you have deployed Vault, you should look over the docs on using
                    Vault with Kubernetes available here:
                    
                    https://developer.hashicorp.com/vault/docs
                    
                    
                    Your release is named vault. To learn more about the release, try:
                    
                      $ helm status vault
                      $ helm get manifest vault
                EOT
              - revision       = 8
              - values         = jsonencode(
                    {
                      - global   = {
                          - tlsDisable = true
                        }
                      - injector = {
                          - enabled = true
                        }
                      - server   = {
                          - auditStorage = {
                              - enabled = false
                            }
                          - dataStorage  = {
                              - enabled      = true
                              - size         = "1Gi"
                              - storageClass = "local-path-retain"
                            }
                          - ha           = {
                              - config   = <<-EOT
                                    ui = true
                                    
                                    listener "tcp" {
                                      address     = "0.0.0.0:8200"
                                      tls_disable = "true"
                                    }
                                    
                                    storage "raft" {
                                      path = "/vault/data"
                                    }
                                    
                                    service_registration "kubernetes" {}
                                EOT
                              - enabled  = true
                              - raft     = {
                                  - enabled   = true
                                  - setNodeId = true
                                }
                              - replicas = 1
                            }
                          - image        = {
                              - repository = "hashicorp/vault"
                              - tag        = "1.20.4"
                            }
                          - service      = {
                              - type = "ClusterIP"
                            }
                        }
                    }
                )
              - version        = "0.31.0"
            },
        ] -> (known after apply)
        name                       = "vault"
      ~ replace                    = false -> true
      ~ status                     = "failed" -> "deployed"
      ~ values                     = [
          - <<-EOT
                "global":
                  "tlsDisable": true
                "injector":
                  "enabled": true
                "server":
                  "auditStorage":
                    "enabled": false
                  "dataStorage":
                    "enabled": false
                  "image":
                    "repository": "hashicorp/vault"
                    "tag": "1.20.4"
                  "service":
                    "type": "ClusterIP"
                  "standalone":
                    "config": |
                      ui = true
                
                      listener "tcp" {
                        address     = "0.0.0.0:8200"
                        tls_disable = "true"
                      }
                
                      storage "postgresql" {
                        connection_url = "postgresql://vault:Ld63FK25alvAwewa18YS85JMPwxzkt@postgresql.platform.svc.cluster.local:5432/vault?sslmode=disable"
                      }
                    "enabled": true
            EOT,
          + <<-EOT
                "global":
                  "tlsDisable": true
                "injector":
                  "enabled": true
                "server":
                  "auditStorage":
                    "enabled": false
                  "dataStorage":
                    "enabled": true
                    "size": "1Gi"
                    "storageClass": "local-path-retain"
                  "ha":
                    "config": |
                      ui = true
                
                      listener "tcp" {
                        address     = "0.0.0.0:8200"
                        tls_disable = "true"
                      }
                
                      storage "raft" {
                        path = "/vault/data"
                      }
                
                      service_registration "kubernetes" {}
                    "enabled": true
                    "raft":
                      "enabled": true
                      "setNodeId": true
                    "replicas": 1
                  "image":
                    "repository": "hashicorp/vault"
                    "tag": "1.20.4"
                  "service":
                    "type": "ClusterIP"
            EOT,
        ]
        # (22 unchanged attributes hidden)
    }

  # kubernetes_cron_job_v1.vault_backup_daily will be created
+ resource "kubernetes_cron_job_v1" "vault_backup_daily" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "vault-backup-daily"
          + namespace        = "platform"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + concurrency_policy            = "Allow"
          + failed_jobs_history_limit     = 1
          + schedule                      = "0 2 * * *"
          + starting_deadline_seconds     = 0
          + successful_jobs_history_limit = 3
          + suspend                       = false

          + job_template {
              + metadata {
                  + generation       = (known after apply)
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                }
              + spec {
                  + backoff_limit   = 6
                  + completion_mode = (known after apply)
                  + completions     = 1
                  + parallelism     = 1

                  + template {
                      + metadata {
                          + generation       = (known after apply)
                          + name             = (known after apply)
                          + resource_version = (known after apply)
                          + uid              = (known after apply)
                        }
                      + spec {
                          + automount_service_account_token  = true
                          + dns_policy                       = "ClusterFirst"
                          + enable_service_links             = true
                          + host_ipc                         = false
                          + host_network                     = false
                          + host_pid                         = false
                          + hostname                         = (known after apply)
                          + node_name                        = (known after apply)
                          + restart_policy                   = "OnFailure"
                          + scheduler_name                   = (known after apply)
                          + service_account_name             = "vault"
                          + share_process_namespace          = false
                          + termination_grace_period_seconds = 30

                          + container {
                              + args                       = [
                                  + <<-EOT
                                        set -e
                                        export VAULT_ADDR="http://vault.platform.svc.cluster.local:8200"
                                                        
                                        # Get root token from secret
                                        ROOT_TOKEN=$(cat /vault-keys/init-keys | jq -r '.root_token')
                                        export VAULT_TOKEN=$ROOT_TOKEN
                                                        
                                        # Create snapshot
                                        BACKUP_FILE="/backup/daily-$(date +%Y%m%d-%H%M%S).snap"
                                        vault operator raft snapshot save $BACKUP_FILE
                                        echo "Backup saved to $BACKUP_FILE"
                                                        
                                        # Cleanup old daily backups (keep 3 days)
                                        find /backup -name "daily-*.snap" -mtime +3 -delete
                                        echo "Cleaned up backups older than 3 days"
                                    EOT,
                                ]
                              + command                    = [
                                  + "/bin/sh",
                                  + "-c",
                                ]
                              + image                      = "hashicorp/vault:1.20.4"
                              + image_pull_policy          = (known after apply)
                              + name                       = "backup"
                              + stdin                      = false
                              + stdin_once                 = false
                              + termination_message_path   = "/dev/termination-log"
                              + termination_message_policy = (known after apply)
                              + tty                        = false

                              + volume_mount {
                                  + mount_path        = "/backup"
                                  + mount_propagation = "None"
                                  + name              = "backup"
                                  + read_only         = false
                                }
                              + volume_mount {
                                  + mount_path        = "/vault-keys"
                                  + mount_propagation = "None"
                                  + name              = "vault-keys"
                                  + read_only         = true
                                }
                            }

                          + volume {
                              + name = "backup"

                              + persistent_volume_claim {
                                  + claim_name = "vault-backup"
                                  + read_only  = false
                                }
                            }
                          + volume {
                              + name = "vault-keys"

                              + secret {
                                  + default_mode = "0644"
                                  + secret_name  = "vault-unseal-keys"
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # kubernetes_cron_job_v1.vault_backup_weekly will be created
+ resource "kubernetes_cron_job_v1" "vault_backup_weekly" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "vault-backup-weekly"
          + namespace        = "platform"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + concurrency_policy            = "Allow"
          + failed_jobs_history_limit     = 1
          + schedule                      = "0 3 * * 0"
          + starting_deadline_seconds     = 0
          + successful_jobs_history_limit = 4
          + suspend                       = false

          + job_template {
              + metadata {
                  + generation       = (known after apply)
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                }
              + spec {
                  + backoff_limit   = 6
                  + completion_mode = (known after apply)
                  + completions     = 1
                  + parallelism     = 1

                  + template {
                      + metadata {
                          + generation       = (known after apply)
                          + name             = (known after apply)
                          + resource_version = (known after apply)
                          + uid              = (known after apply)
                        }
                      + spec {
                          + automount_service_account_token  = true
                          + dns_policy                       = "ClusterFirst"
                          + enable_service_links             = true
                          + host_ipc                         = false
                          + host_network                     = false
                          + host_pid                         = false
                          + hostname                         = (known after apply)
                          + node_name                        = (known after apply)
                          + restart_policy                   = "OnFailure"
                          + scheduler_name                   = (known after apply)
                          + service_account_name             = "vault"
                          + share_process_namespace          = false
                          + termination_grace_period_seconds = 30

                          + container {
                              + args                       = [
                                  + <<-EOT
                                        set -e
                                        export VAULT_ADDR="http://vault.platform.svc.cluster.local:8200"
                                                        
                                        # Get root token from secret
                                        ROOT_TOKEN=$(cat /vault-keys/init-keys | jq -r '.root_token')
                                        export VAULT_TOKEN=$ROOT_TOKEN
                                                        
                                        # Create snapshot
                                        BACKUP_FILE="/backup/weekly-$(date +%Y%m%d-%H%M%S).snap"
                                        vault operator raft snapshot save $BACKUP_FILE
                                        echo "Backup saved to $BACKUP_FILE"
                                                        
                                        # Cleanup old weekly backups (keep 4 weeks / 1 month)
                                        find /backup -name "weekly-*.snap" -mtime +28 -delete
                                        echo "Cleaned up backups older than 28 days"
                                    EOT,
                                ]
                              + command                    = [
                                  + "/bin/sh",
                                  + "-c",
                                ]
                              + image                      = "hashicorp/vault:1.20.4"
                              + image_pull_policy          = (known after apply)
                              + name                       = "backup"
                              + stdin                      = false
                              + stdin_once                 = false
                              + termination_message_path   = "/dev/termination-log"
                              + termination_message_policy = (known after apply)
                              + tty                        = false

                              + volume_mount {
                                  + mount_path        = "/backup"
                                  + mount_propagation = "None"
                                  + name              = "backup"
                                  + read_only         = false
                                }
                              + volume_mount {
                                  + mount_path        = "/vault-keys"
                                  + mount_propagation = "None"
                                  + name              = "vault-keys"
                                  + read_only         = true
                                }
                            }

                          + volume {
                              + name = "backup"

                              + persistent_volume_claim {
                                  + claim_name = "vault-backup"
                                  + read_only  = false
                                }
                            }
                          + volume {
                              + name = "vault-keys"

                              + secret {
                                  + default_mode = "0644"
                                  + secret_name  = "vault-unseal-keys"
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # kubernetes_persistent_volume_claim.vault_backup is tainted, so must be replaced
-/+ resource "kubernetes_persistent_volume_claim" "vault_backup" {
      ~ id               = "platform/vault-backup" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 0 -> (known after apply)
          - labels           = {} -> null
            name             = "vault-backup"
          ~ resource_version = "346708" -> (known after apply)
          ~ uid              = "be4bb6eb-aed4-4f4c-aeba-44ab68c8f6d1" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ spec {
          ~ volume_mode        = "Filesystem" -> (known after apply)
          + volume_name        = (known after apply)
            # (2 unchanged attributes hidden)

          ~ resources {
              - limits   = {} -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # null_resource.vault_init will be created
+ resource "null_resource" "vault_init" {
      + id       = (known after apply)
      + triggers = {
          + "vault_release" = (known after apply)
        }
    }

Plan: 4 to add, 1 to change, 1 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p platform`
* :put_litter_in_its_place: To **delete** this plan click [here](https://i-atlantis.truealpha.club/lock?id=wangzitian0%252Finfra%252F2.platform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p platform`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 4 to add, 1 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`